In [4]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\tibame\anaconda3\envs\kiddpy\lib\site-packages (1.3.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\tibame\anaconda3\envs\kiddpy\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\tibame\anaconda3\envs\kiddpy\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: numpy>=1.17.3 in c:\users\tibame\anaconda3\envs\kiddpy\lib\site-packages (from pandas) (1.21.1)
Requirement already satisfied: six>=1.5 in c:\users\tibame\anaconda3\envs\kiddpy\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [6]:
import pandas as pd

In [9]:
x= pd.Series([1,2,3,4,5,6])
x

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [11]:
pd.Series(['a','b','c','d'])

0    a
1    b
2    c
3    d
dtype: object

In [13]:
x.values

array([1, 2, 3, 4, 5, 6], dtype=int64)

In [15]:
x.dtype

dtype('int64')

In [17]:
x[0]

1

In [19]:
x[3]

4

In [21]:
x.index

RangeIndex(start=0, stop=6, step=1)

In [23]:
x[[0,2,1]]

0    1
2    3
1    2
dtype: int64

In [24]:
x

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [26]:
x[0] =0
x

0    0
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [30]:
y = pd.Series([1,2,3,4,5,6,7,8], index=['a','b','c','d','e','f','g','h'])
y

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [32]:
y['a']

1

In [34]:
y[0]

1

In [36]:
y[['a','b','c']]

a    1
b    2
c    3
dtype: int64

In [38]:
y

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [40]:
y + 2

a     3
b     4
c     5
d     6
e     7
f     8
g     9
h    10
dtype: int64

In [42]:
y - 2

a   -1
b    0
c    1
d    2
e    3
f    4
g    5
h    6
dtype: int64

In [44]:
y / 2

a    0.5
b    1.0
c    1.5
d    2.0
e    2.5
f    3.0
g    3.5
h    4.0
dtype: float64

In [45]:
y

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [48]:
y>3

a    False
b    False
c    False
d     True
e     True
f     True
g     True
h     True
dtype: bool

In [50]:
y[y>3]

d    4
e    5
f    6
g    7
h    8
dtype: int64

In [52]:
y[y >3/2]

b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [54]:
y[y ==3]

c    3
dtype: int64

In [ ]:
y = pd.Series([1,2,3,4,5,6,7,8], index=['a','b','c','d','e','f','g','h'])
y

In [61]:
z = pd.Series({'apple':30,'banana':30,'orange':20,'peach':60,}) #以字典方式建立
z

apple     30
banana    30
orange    20
peach     60
dtype: int64

In [63]:
z[z>40]

peach    60
dtype: int64

In [64]:
z.unique()

array([30, 20, 60], dtype=int64)

In [65]:
z.index = [0,1,2,3]#取代index
z

0    30
1    30
2    20
3    60
dtype: int64

## dataframe

In [66]:
#字典方式建立dataframe

data1 = {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella'],
        'age': [23, 30, 38, 27, 45],
        'sex': ['M', 'M', 'F', 'M', 'F']}
df1 = pd.DataFrame(data1)
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [67]:
#先用大list 再命名 columns

data2 = [['Alan Chen', 23, 'M'], 
         ['Bob Yeh', 30, 'M'],
         ['Connie Ho', 38, 'F'],
         ['Daniel Chang', 27, 'M'],
         ['Ella Hsu', 45, 'F']]
df2 = pd.DataFrame(data2, columns=['name', 'age', 'sex'])
df2

           name  age sex
0     Alan Chen   23   M
1       Bob Yeh   30   M
2     Connie Ho   38   F
3  Daniel Chang   27   M
4      Ella Hsu   45   F

In [68]:
df1.columns

Index(['name', 'age', 'sex'], dtype='object')

In [69]:
df1.index

RangeIndex(start=0, stop=5, step=1)

In [70]:
df1.values

array([['Alan', 23, 'M'],
       ['Bob', 30, 'M'],
       ['Connie', 38, 'F'],
       ['Daniel', 27, 'M'],
       ['Ella', 45, 'F']], dtype=object)

In [71]:
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [72]:
df1['name']

0      Alan
1       Bob
2    Connie
3    Daniel
4      Ella
Name: name, dtype: object

In [75]:
df1.name

0      Alan
1       Bob
2    Connie
3    Daniel
4      Ella
Name: name, dtype: object

In [74]:
df1[['name']]#用兩個括號是呈現表格樣

     name
0    Alan
1     Bob
2  Connie
3  Daniel
4    Ella

In [76]:
df1[['name','age']]

     name  age
0    Alan   23
1     Bob   30
2  Connie   38
3  Daniel   27
4    Ella   45

In [78]:
df1[:2]#叫前2個欄位

   name  age sex
0  Alan   23   M
1   Bob   30   M

In [82]:
df1[:3][['name']]

     name
0    Alan
1     Bob
2  Connie

In [83]:
df1[:3]['name']

0      Alan
1       Bob
2    Connie
Name: name, dtype: object

In [87]:
df1[df1['sex'] =='F']

     name  age sex
2  Connie   38   F
4    Ella   45   F

In [89]:
df1['sex'] =='F'

0    False
1    False
2     True
3    False
4     True
Name: sex, dtype: bool

In [90]:
df1[df1['sex'] =='F']['age']

2    38
4    45
Name: age, dtype: int64

In [98]:
df1[df1['sex'] =='F']['age']

2    38
4    45
Name: age, dtype: int64

## Info

In [99]:
df1.head(3)

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F

In [100]:
df1.head(2)

   name  age sex
0  Alan   23   M
1   Bob   30   M

In [101]:
df1.head()

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [102]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   sex     5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [104]:
df1.describe()

             age
count   5.000000
mean   32.600000
std     8.848729
min    23.000000
25%    27.000000
50%    30.000000
75%    38.000000
max    45.000000

In [106]:
df1[['name', 'sex']].describe()

        name sex
count      5   5
unique     5   2
top     Alan   M
freq       1   3

In [108]:
df1.drop('age', axis=1)#刪欄 但沒取代  del df2['age'] 用del 會取代

     name sex
0    Alan   M
1     Bob   M
2  Connie   F
3  Daniel   M
4    Ella   F

In [109]:
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [111]:
data3 = {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella', 'Alan'],
        'age': [23, 30, 38, 27, 45, 10],
        'sex': ['M', 'M', 'F', 'M', 'F', 'M']}
df3 = pd.DataFrame(data3)
df3

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F
5    Alan   10   M

In [112]:
df3[['name', 'sex']].describe()

        name sex
count      6   6
unique     5   2
top     Alan   M
freq       2   4

## iloc

In [ ]:
#用數字找

In [115]:
df1.iloc[0]

name    Alan
age       23
sex        M
Name: 0, dtype: object

In [117]:
df1.iloc[0,0]  #先row,然後column

'Alan'

In [118]:
df1.iloc[4,1]

45

In [120]:
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [126]:
df1.iloc[:3,0]

0      Alan
1       Bob
2    Connie
Name: name, dtype: object

In [127]:
df1.iloc[0, :2]

name    Alan
age       23
Name: 0, dtype: object

In [128]:
df1.iloc[[0,2,4],0]

0      Alan
2    Connie
4      Ella
Name: name, dtype: object

In [129]:
df1.iloc[[4,2,4],0]

4      Ella
2    Connie
4      Ella
Name: name, dtype: object

In [130]:
df1.iloc[[0,2,4], [0,2]]

     name sex
0    Alan   M
2  Connie   F
4    Ella   F

## loc

In [131]:
#用名稱來找

In [132]:
df1.loc[:,'name']

0      Alan
1       Bob
2    Connie
3    Daniel
4      Ella
Name: name, dtype: object

In [135]:
df1.loc[:,['name', 'sex']]

     name sex
0    Alan   M
1     Bob   M
2  Connie   F
3  Daniel   M
4    Ella   F

In [136]:
df1.loc[:3,['name','sex']]

     name sex
0    Alan   M
1     Bob   M
2  Connie   F
3  Daniel   M

In [137]:
df1.index = ['a','b','c','d','e']
df1

     name  age sex
a    Alan   23   M
b     Bob   30   M
c  Connie   38   F
d  Daniel   27   M
e    Ella   45   F

In [138]:
df1.loc[['a','b','c','d'],['name','sex']]

     name sex
a    Alan   M
b     Bob   M
c  Connie   F
d  Daniel   M

In [139]:
df1.loc[:'d',['name','sex']]

     name sex
a    Alan   M
b     Bob   M
c  Connie   F
d  Daniel   M

In [140]:
df1

     name  age sex
a    Alan   23   M
b     Bob   30   M
c  Connie   38   F
d  Daniel   27   M
e    Ella   45   F

In [141]:
df1.loc[df1.age >30]

     name  age sex
c  Connie   38   F
e    Ella   45   F

In [142]:
df1.loc[df1.age >30, 'name']

c    Connie
e      Ella
Name: name, dtype: object

In [145]:
 df1.loc[df1.age >30, ['name']]#加括號 呈現表格

     name
c  Connie
e    Ella

In [146]:
df1.loc[df1.age >30, 'age'] =99 #取代
df1

     name  age sex
a    Alan   23   M
b     Bob   30   M
c  Connie   99   F
d  Daniel   27   M
e    Ella   99   F

## math

In [148]:
df1.max()

name    Ella
age       99
sex        M
dtype: object

In [149]:
df1.min()

name    Alan
age       23
sex        F
dtype: object

In [150]:
df1.sum()

name    AlanBobConnieDanielElla
age                         278
sex                       MMFMF
dtype: object

In [151]:
df1.cumsum()

                      name  age    sex
a                     Alan   23      M
b                  AlanBob   53     MM
c            AlanBobConnie  152    MMF
d      AlanBobConnieDaniel  179   MMFM
e  AlanBobConnieDanielElla  278  MMFMF

## STR

In [152]:
df1['sex'].str.replace('M','Male')

a    Male
b    Male
c       F
d    Male
e       F
Name: sex, dtype: object

In [153]:
df1['sex']=df1['sex'].str.replace('M','Male')

In [154]:
df1

     name  age   sex
a    Alan   23  Male
b     Bob   30  Male
c  Connie   99     F
d  Daniel   27  Male
e    Ella   99     F

In [155]:

data1 = {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella'],
        'age': [23, 30, 38, 27, 45],
        'sex': ['M', 'M', 'F', 'M', 'F']}
df1 = pd.DataFrame(data1)
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [156]:
df2

           name  age sex
0     Alan Chen   23   M
1       Bob Yeh   30   M
2     Connie Ho   38   F
3  Daniel Chang   27   M
4      Ella Hsu   45   F

In [157]:
df2['name'].str.split(' ')

0       [Alan, Chen]
1         [Bob, Yeh]
2       [Connie, Ho]
3    [Daniel, Chang]
4        [Ella, Hsu]
Name: name, dtype: object

In [158]:
df2

           name  age sex
0     Alan Chen   23   M
1       Bob Yeh   30   M
2     Connie Ho   38   F
3  Daniel Chang   27   M
4      Ella Hsu   45   F

In [159]:
df2['name'].str.split(' ',expand=True)#分成兩個欄位

        0      1
0    Alan   Chen
1     Bob    Yeh
2  Connie     Ho
3  Daniel  Chang
4    Ella    Hsu

In [160]:
df2['name'].str.split(' ',expand=True)[0]#查詢

0      Alan
1       Bob
2    Connie
3    Daniel
4      Ella
Name: 0, dtype: object

In [161]:
df2['name'].str.contains('n') #看誰有包含n

0     True
1    False
2     True
3     True
4    False
Name: name, dtype: bool

## apply

In [163]:
df1['age']

   age
0   23
1   30
2   38
3   27
4   45

In [166]:
df1['age'].apply(lambda a: '%.1f' % a)

0    23.0
1    30.0
2    38.0
3    27.0
4    45.0
Name: age, dtype: object

In [169]:
def f(series):
    return series -5
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [170]:
data3 = [[12, 25, 3, 34, 65],
         [65, 19, 28, 39, 10],
         [11, 19, 13, 34, 1]]
df3 = pd.DataFrame(data3, columns=['d', 'a', 'c', 'e', 'b'], index=['banana', 'apple', 'orange'])
df3

         d   a   c   e   b
banana  12  25   3  34  65
apple   65  19  28  39  10
orange  11  19  13  34   1

## sort

In [171]:
df3.sort_index()

         d   a   c   e   b
apple   65  19  28  39  10
banana  12  25   3  34  65
orange  11  19  13  34   1

In [172]:
df3.sort_index(ascending=False)

         d   a   c   e   b
orange  11  19  13  34   1
banana  12  25   3  34  65
apple   65  19  28  39  10

In [173]:
df3.sort_index(axis=1)

         a   b   c   d   e
banana  25  65   3  12  34
apple   19  10  28  65  39
orange  19   1  13  11  34

In [175]:
df3.sort_values(by='a')

         d   a   c   e   b
apple   65  19  28  39  10
orange  11  19  13  34   1
banana  12  25   3  34  65

In [177]:
df3.sort_values(by='a',ascending=False)

         d   a   c   e   b
banana  12  25   3  34  65
apple   65  19  28  39  10
orange  11  19  13  34   1

In [178]:
df3.sort_values(by=['a','b'],ascending=False)

         d   a   c   e   b
banana  12  25   3  34  65
apple   65  19  28  39  10
orange  11  19  13  34   1

## rank

In [180]:
df3.rank()

          d    a    c    e    b
banana  2.0  3.0  1.0  1.5  3.0
apple   3.0  1.5  3.0  3.0  2.0
orange  1.0  1.5  2.0  1.5  1.0

In [181]:
df3

         d   a   c   e   b
banana  12  25   3  34  65
apple   65  19  28  39  10
orange  11  19  13  34   1

In [182]:
df3.rank(method='min')

          d    a    c    e    b
banana  2.0  3.0  1.0  1.0  3.0
apple   3.0  1.0  3.0  3.0  2.0
orange  1.0  1.0  2.0  1.0  1.0

In [183]:
df3.rank(method='max')

          d    a    c    e    b
banana  2.0  3.0  1.0  2.0  3.0
apple   3.0  2.0  3.0  3.0  2.0
orange  1.0  2.0  2.0  2.0  1.0

In [184]:
df3.rank(method='first')

          d    a    c    e    b
banana  2.0  3.0  1.0  1.0  3.0
apple   3.0  1.0  3.0  3.0  2.0
orange  1.0  2.0  2.0  2.0  1.0

## value_counts

In [185]:
df1['sex'].value_counts()

M    3
F    2
Name: sex, dtype: int64

In [186]:
df1['sex'].value_counts().sort_values()

F    2
M    3
Name: sex, dtype: int64

In [188]:
df1['sex'].value_counts().sort_values(ascending=False)

M    3
F    2
Name: sex, dtype: int64

## Group by

In [189]:
data4 = {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella'],
        'age': [23, 30, 38, 27, 45],
        'sex': ['M', 'M', 'F', 'M', 'F'],
        'dept': [1, 1, 1, 2, 2]}
df4 = pd.DataFrame(data4)
df4

     name  age sex  dept
0    Alan   23   M     1
1     Bob   30   M     1
2  Connie   38   F     1
3  Daniel   27   M     2
4    Ella   45   F     2

In [191]:
df4.groupby('sex').count()

     name  age  dept
sex
F       2    2     2
M       3    3     3

In [192]:
df4.groupby('sex').mean()

           age      dept
sex
F    41.500000  1.500000
M    26.666667  1.333333

In [193]:
df4.groupby('sex').sum()

     age  dept
sex
F     83     3
M     80     4

In [195]:
df4.groupby('sex').std()

          age      dept
sex
F    4.949747  0.707107
M    3.511885  0.577350

In [197]:
df4.groupby('sex').var()

           age      dept
sex
F    24.500000  0.500000
M    12.333333  0.333333

In [199]:
df4.groupby('sex').count()

     name  age  dept
sex
F       2    2     2
M       3    3     3

In [201]:
df4.groupby(['sex', 'dept']).count()

          name  age
sex dept
F   1        1    1
    2        1    1
M   1        2    2
    2        1    1

In [203]:
df4.groupby(['sex', 'dept']).mean()#平均值

           age
sex dept
F   1     38.0
    2     45.0
M   1     26.5
    2     27.0

In [205]:
df4.groupby(['sex', 'dept']).count()[['name','age']]

          name  age
sex dept
F   1        1    1
    2        1    1
M   1        2    2
    2        1    1

In [208]:
df4.groupby(['sex', 'dept']).count()[['name']]

          name
sex dept
F   1        1
    2        1
M   1        2
    2        1

In [207]:
df4.groupby(['sex', 'dept']).count()[['name']].rename(columns={'name':'count'})#改名

          count
sex dept
F   1         1
    2         1
M   1         2
    2         1

In [210]:
df4.groupby(['sex', 'dept']).count()

          name  age
sex dept
F   1        1    1
    2        1    1
M   1        2    2
    2        1    1

In [212]:
df4.groupby(['sex', 'dept'],as_index=False).count()

  sex  dept  name  age
0   F     1     1    1
1   F     2     1    1
2   M     1     2    2
3   M     2     1    1

In [213]:
df4.groupby(['sex', 'dept']).mean()

           age
sex dept
F   1     38.0
    2     45.0
M   1     26.5
    2     27.0

In [214]:
df4.groupby(['sex', 'dept']).agg([('age','mean'),('name','count')])

           age
           age name
sex dept
F   1     38.0    1
    2     45.0    1
M   1     26.5    2
    2     27.0    1

In [215]:
df4.groupby(['sex', 'dept']).describe()

           age
         count  mean       std   min    25%   50%    75%   max
sex dept
F   1      1.0  38.0       NaN  38.0  38.00  38.0  38.00  38.0
    2      1.0  45.0       NaN  45.0  45.00  45.0  45.00  45.0
M   1      2.0  26.5  4.949747  23.0  24.75  26.5  28.25  30.0
    2      1.0  27.0       NaN  27.0  27.00  27.0  27.00  27.0